Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA028.PIC
      <edc:SFRDef edc:access="-----------------------n-------n" edc:cname="PMD1" edc:desc="" edc:impl="0x101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------u-------0" edc:name="PMD1" edc:nzwidth="0x20" edc:por="-----------------------x-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F800040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMUMD" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nn--------------nn" edc:cname="PMD2" edc:desc="" edc:impl="0x30003" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------uu--------------00" edc:name="PMD2" edc:nzwidth="0x20" edc:por="--------------xx--------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F800050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="OPA1MD" edc:desc="" edc:mask="0x1" edc:name="OPA1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA2MD" edc:desc="" edc:mask="0x1" edc:name="OPA2MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------nnnn------------nnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xf000f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------0000------------0000" edc:name="PMD3" edc:nzwidth="0x20" edc:por="------------0000------------0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F800060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------nnnn-----------nnnnn" edc:cname="PMD4" edc:desc="" edc:impl="0xf001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------uuuu-----------00000" edc:name="PMD4" edc:nzwidth="0x20" edc:por="------------xxxx-----------11111" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F800070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="PWM1MD" edc:mask="0x1" edc:name="PWM1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM2MD" edc:mask="0x1" edc:name="PWM2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM3MD" edc:mask="0x1" edc:name="PWM3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM4MD" edc:mask="0x1" edc:name="PWM4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nn------nn------nn" edc:cname="PMD5" edc:desc="" edc:impl="0x30303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00------00------00" edc:name="PMD5" edc:nzwidth="0x20" edc:por="--------------00------00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F800080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nn------------nnnn-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x13b21f01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uu------------0000-------0" edc:name="PMD6" edc:nzwidth="0x20" edc:por="------xx------------0000-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F800090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:desc="" edc:mask="0x1" edc:name="REFO1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:desc="" edc:mask="0x1" edc:name="REFO2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:desc="" edc:mask="0x1" edc:name="REFO3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:desc="" edc:mask="0x1" edc:name="REFO4MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:SFRFieldDef edc:cname="QEI1MD" edc:mask="0x1" edc:name="QEI1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI2MD" edc:mask="0x1" edc:name="QEI2MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------n----" edc:cname="PMD7" edc:desc="" edc:impl="0x10" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------0----" edc:name="PMD7" edc:nzwidth="0x20" edc:por="---------------------------0----" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F8000A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMAMD" edc:desc="" edc:mask="0x1" edc:name="DMAMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F8000B0"/>
      <edc:SFRDef edc:access="------nnnn----------------nn--nn" edc:cname="CFGPG" edc:desc="" edc:impl="0x3c00033" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000----------------00--00" edc:name="CFGPG" edc:nzwidth="32" edc:por="------0000----------------00--00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG" edc:_modsrc="DOS-02481_WACP_Config.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf0" edc:_addr="0x1F8000E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUPG" edc:desc="" edc:mask="0x3" edc:name="CPUPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DMAPG" edc:desc="" edc:mask="0x3" edc:name="DMAPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="FCPG" edc:desc="" edc:mask="0x3" edc:name="FCPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCPG" edc:desc="" edc:mask="0x3" edc:name="ADCPG" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
