Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA028.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC18" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC18" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810260">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA0IS" edc:desc="" edc:mask="0x3" edc:name="DMA0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA0IP" edc:desc="" edc:mask="0x7" edc:name="DMA0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA1IS" edc:desc="" edc:mask="0x3" edc:name="DMA1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA1IP" edc:desc="" edc:mask="0x7" edc:name="DMA1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA2IS" edc:desc="" edc:mask="0x3" edc:name="DMA2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA2IP" edc:desc="" edc:mask="0x7" edc:name="DMA2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA3IS" edc:desc="" edc:mask="0x3" edc:name="DMA3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA3IP" edc:desc="" edc:mask="0x7" edc:name="DMA3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x40" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810270"/>
      <edc:SFRDef edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC23" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------00000" edc:name="IPC23" edc:nzwidth="32" edc:por="---00000---00000-----------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102B0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1IS" edc:desc="" edc:mask="0x3" edc:name="AD1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1IP" edc:desc="" edc:mask="0x7" edc:name="AD1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC24" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC24" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF1IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC25" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC25" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1F1IS" edc:desc="" edc:mask="0x3" edc:name="AD1F1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1F1IP" edc:desc="" edc:mask="0x7" edc:name="AD1F1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIS" edc:desc="" edc:mask="0x3" edc:name="AD1EOSIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIP" edc:desc="" edc:mask="0x7" edc:name="AD1EOSIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1ARIS" edc:desc="" edc:mask="0x3" edc:name="AD1ARIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1ARIP" edc:desc="" edc:mask="0x7" edc:name="AD1ARIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1RSIS" edc:desc="" edc:mask="0x3" edc:name="AD1RSIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1RSIP" edc:desc="" edc:mask="0x7" edc:name="AD1RSIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC26" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC26" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1FCBTIS" edc:desc="" edc:mask="0x3" edc:name="AD1FCBTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIP" edc:desc="" edc:mask="0x7" edc:name="AD1FCBTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1G1IS" edc:desc="" edc:mask="0x3" edc:name="AD1G1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1G1IP" edc:desc="" edc:mask="0x7" edc:name="AD1G1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D0IS" edc:desc="" edc:mask="0x3" edc:name="AD1D0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D0IP" edc:desc="" edc:mask="0x7" edc:name="AD1D0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D1IS" edc:desc="" edc:mask="0x3" edc:name="AD1D1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D1IP" edc:desc="" edc:mask="0x7" edc:name="AD1D1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC27" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC27" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D2IS" edc:desc="" edc:mask="0x3" edc:name="AD1D2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D2IP" edc:desc="" edc:mask="0x7" edc:name="AD1D2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D3IS" edc:desc="" edc:mask="0x3" edc:name="AD1D3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D3IP" edc:desc="" edc:mask="0x7" edc:name="AD1D3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D4IS" edc:desc="" edc:mask="0x3" edc:name="AD1D4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D4IP" edc:desc="" edc:mask="0x7" edc:name="AD1D4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D5IS" edc:desc="" edc:mask="0x3" edc:name="AD1D5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D5IP" edc:desc="" edc:mask="0x7" edc:name="AD1D5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------------" edc:cname="IPC28" edc:impl="0xe0e0e0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="IPC28" edc:nzwidth="32" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810300">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe0e0e0e0" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn------------------------" edc:cname="IPC29" edc:impl="0xffe0e0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000------------------------" edc:name="IPC29" edc:nzwidth="32" edc:por="---00000------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810310">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D13IS" edc:desc="" edc:mask="0x3" edc:name="AD1D13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D13IP" edc:desc="" edc:mask="0x7" edc:name="AD1D13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffe0e0e0" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC30" edc:impl="0xffffffe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000--------" edc:name="IPC30" edc:nzwidth="32" edc:por="---00000---00000---00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810320">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D15IS" edc:desc="" edc:mask="0x3" edc:name="AD1D15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D15IP" edc:desc="" edc:mask="0x7" edc:name="AD1D15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D16IS" edc:desc="" edc:mask="0x3" edc:name="AD1D16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D16IP" edc:desc="" edc:mask="0x7" edc:name="AD1D16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D17IS" edc:desc="" edc:mask="0x3" edc:name="AD1D17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D17IP" edc:desc="" edc:mask="0x7" edc:name="AD1D17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffe0" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x80" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810330"/>
      <edc:SFRDef edc:access="---nnnnn-------------------nnnnn" edc:cname="IPC39" edc:impl="0xffe0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-------------------00000" edc:name="IPC39" edc:nzwidth="32" edc:por="---00000-------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8103B0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D50IS" edc:desc="" edc:mask="0x3" edc:name="AD1D50IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D50IP" edc:desc="" edc:mask="0x7" edc:name="AD1D50IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="19"/>
            <edc:SFRFieldDef edc:cname="AD1D53IS" edc:desc="" edc:mask="0x3" edc:name="AD1D53IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D53IP" edc:desc="" edc:mask="0x7" edc:name="AD1D53IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="IPC40" edc:impl="0xffe0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="IPC40" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8103C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IS" edc:desc="" edc:mask="0x3" edc:name="CMP3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP3IP" edc:desc="" edc:mask="0x7" edc:name="CMP3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
