Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA028.PIC
      <edc:SFRDef edc:access="----------------rrr--crrccrccrrr" edc:cname="I2C1STAT" edc:desc="" edc:impl="0xe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000--00000000000" edc:name="I2C1STAT" edc:nzwidth="32" edc:por="----------------000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x70" edc:_addr="0x1F826010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBF" edc:desc="" edc:mask="0x1" edc:name="TBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBF" edc:desc="" edc:mask="0x1" edc:name="RBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2COV" edc:desc="" edc:mask="0x1" edc:name="I2COV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IWCOL" edc:desc="" edc:mask="0x1" edc:name="IWCOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADD10" edc:desc="" edc:mask="0x1" edc:name="ADD10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCSTAT" edc:desc="" edc:mask="0x1" edc:name="GCSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSTAT" edc:desc="" edc:mask="0x1" edc:name="TRSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2CPOV" edc:desc="" edc:mask="0x1" edc:name="I2CPOV" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------nnnnnnnnnn" edc:cname="I2C1ADD" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C1ADD" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x70" edc:_addr="0x1F826020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CADD" edc:desc="" edc:mask="0x3ff" edc:name="I2CADD" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------nnnnnnnnnn" edc:cname="I2C1MSK" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C1MSK" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x70" edc:_addr="0x1F826030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CMSK" edc:desc="" edc:mask="0x3ff" edc:name="I2CMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AMSK" edc:desc="" edc:mask="0x3ff" edc:name="AMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2C1BRG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="I2C1BRG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x70" edc:_addr="0x1F826040">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:mask="0xffff" edc:name="I2CBRG" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------wwwwwwww" edc:cname="I2C1TRN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="I2C1TRN" edc:nzwidth="32" edc:por="------------------------11111111" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x70" edc:_addr="0x1F826050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------rrrrrrrr" edc:cname="I2C1RCV" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C1RCV" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x70" edc:_addr="0x1F826060">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
